---
kind: method
id: M:Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Start(Autodesk.Revit.DB.ElementId)
source: html/44d01f6d-71ed-7ebd-5632-704f90b1fcdc.htm
---
# Autodesk.Revit.DB.Visual.AppearanceAssetEditScope.Start Method

Starts the edit scope.

## Syntax (C#)
```csharp
public Asset Start(
	ElementId assetElementId
)
```

## Parameters
- **assetElementId** (`Autodesk.Revit.DB.ElementId`) - The appearance asset element whose asset should be edited.

## Returns
The appearance asset to be used for editing.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null